Tekla Open API Reference for Tekla Structures 2025
ViewMarkSymbolAttributes Methods
The View.ViewMarkSymbolAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewMarkBasicSymbolAttributes.IsEqual(Object).)
Top
See Also
Reference
View.ViewMarkSymbolAttributes Class
Tekla.Structures.Drawing Namespace